1) At the beginning of your Jupyter notebook, include the following code chunk. This will
load required packages:

In [1]:
import numpy as np
from datascience import *
%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')
import warnings
warnings.simplefilter(action="ignore", category=FutureWarning)

2) Use basic Python operators to find the number of seconds in the month of June. Find the
number of seconds that have lapsed between 1 June at noon and 14 Aug, 9:30 AM.

In [2]:
sec_in_day=60*60*24

In [3]:
junedays=30
sec_in_june=junedays*sec_in_day
sec_in_june

2592000

In [4]:
total_days=29+31+13+(21.5/24)
total_seconds=sec_in_day*total_days
total_seconds

6384600.0

3) Import a table (‘world_population.csv’)

In [5]:
worldpop=Table.read_table('world_population.csv')
worldpop

Population
2557628654
2594939877
2636772306
2682053389
2730228104
2782098943
2835299673
2891349717
2948137248
3000716593
... (56 rows omitted)

a. The population in 2015 (the dataset begins at 1950).

In [6]:
worldpop.num_rows

66

In [7]:
worldpop.take(65)

Population
7256490011

b. The population growth between 1950 and 2015.

In [8]:
pop_array = worldpop.column('Population')
pop_growth=pop_array[65]-pop_array[0]
pop_growth

4698861357

c. The average annual growth rate over the course of the dataset.

In [9]:
agr=((pop_array[65]/pop_array[0])**(1/66))-1
agr

0.015925721968250928

4) The ‘Titanic’ dataset describes passengers on the Titanic when it sank. Url:
https://raw.githubusercontent.com/oikobill/Kaggle/master/Titanic/data/train.csv.
Information about this dataset can be found at a kaggle site
(https://www.kaggle.com/c/titanic). Import this dataset

In [10]:
from datascience import *
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')
import warnings
warnings.simplefilter(action="ignore", category=FutureWarning)

from urllib.request import urlopen
import re
def read_url(url):
    return re.sub('\\s+', ' ', urlopen(url).read().decode())

In [11]:
titanic_url='https://raw.githubusercontent.com/oikobill/Kaggle/master/Titanic/data/train.csv'
titanic_table= Table.read_table(titanic_url)

a. Relabel the ‘Pclass’ column to ‘passenger_class’.

In [29]:
titanic_table1=titanic_table.relabeled('Pclass','passenger_class')
titanic_table1

PassengerId | Survived | passenger_class | Name                                                | Sex    | Age  | SibSp | Parch | Ticket           | Fare    | Cabin | Embarked
1           | 0        | 3               | Braund, Mr. Owen Harris                             | male   | 22   | 1     | 0     | A/5 21171        | 7.25    | nan   | S
2           | 1        | 1               | Cumings, Mrs. John Bradley (Florence Briggs Thayer) | female | 38   | 1     | 0     | PC 17599         | 71.2833 | C85   | C
3           | 1        | 3               | Heikkinen, Miss. Laina                              | female | 26   | 0     | 0     | STON/O2. 3101282 | 7.925   | nan   | S
4           | 1        | 1               | Futrelle, Mrs. Jacques Heath (Lily May Peel)        | female | 35   | 1     | 0     | 113803           | 53.1    | C123  | S
5           | 0        | 3               | Allen, Mr. William Henry                            | male   | 35   | 0     | 0     | 373450           | 8.05    | nan   | S
6           | 0        | 3               | Moran, Mr. James                                    | male   | nan  | 0     | 0     | 330877           | 8.4583  | nan   | Q
7           | 0        | 1               | McCarthy, Mr. Timothy J                             | male   | 54   | 0     | 0     | 17463            | 51.8625 | E46   | S
8           | 0        | 3               | Palsson, Master. Gosta Leonard                      | male   | 2    | 3     | 1     | 349909           | 21.075  | nan   | S
9           | 1        | 3               | Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)   | female | 27   | 0     | 2     | 347742           | 11.1333 | nan   | S
10          | 1        | 2               | Nasser, Mrs. Nicholas (Adele Achem)                 | female | 14   | 1     | 0     | 237736           | 30.0708 | nan   | C
... (881 rows omitted)

b. Create a new column ‘family_size’ that adds the number of siblings/spouses,
‘SibSp’, to the number of children, ‘Parch’.

In [30]:
sibcount=titanic_table1.column('SibSp')
relcount=titanic_table1.column('Parch')
famcount=sibcount+relcount
titanic_table2=titanic_table1.with_column('family_size',famcount)
titanic_table2

PassengerId | Survived | passenger_class | Name                                                | Sex    | Age  | SibSp | Parch | Ticket           | Fare    | Cabin | Embarked | family_size
1           | 0        | 3               | Braund, Mr. Owen Harris                             | male   | 22   | 1     | 0     | A/5 21171        | 7.25    | nan   | S        | 1
2           | 1        | 1               | Cumings, Mrs. John Bradley (Florence Briggs Thayer) | female | 38   | 1     | 0     | PC 17599         | 71.2833 | C85   | C        | 1
3           | 1        | 3               | Heikkinen, Miss. Laina                              | female | 26   | 0     | 0     | STON/O2. 3101282 | 7.925   | nan   | S        | 0
4           | 1        | 1               | Futrelle, Mrs. Jacques Heath (Lily May Peel)        | female | 35   | 1     | 0     | 113803           | 53.1    | C123  | S        | 1
5           | 0        | 3               | Allen, Mr. William Henry                            | male   | 35   | 0     | 0     | 373450           | 8.05    | nan   | S        | 0
6           | 0        | 3               | Moran, Mr. James                                    | male   | nan  | 0     | 0     | 330877           | 8.4583  | nan   | Q        | 0
7           | 0        | 1               | McCarthy, Mr. Timothy J                             | male   | 54   | 0     | 0     | 17463            | 51.8625 | E46   | S        | 0
8           | 0        | 3               | Palsson, Master. Gosta Leonard                      | male   | 2    | 3     | 1     | 349909           | 21.075  | nan   | S        | 4
9           | 1        | 3               | Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)   | female | 27   | 0     | 2     | 347742           | 11.1333 | nan   | S        | 2
10          | 1        | 2               | Nasser, Mrs. Nicholas (Adele Achem)                 | female | 14   | 1     | 0     | 237736           | 30.0708 | nan   | C        | 1
... (881 rows omitted)

c. Create a barplot of number of passengers, broken down by passenger class.
HINT: you will need to use the group method on the dataset; for more info, see
the datascience package help.

In [23]:
class_table=titanic_table.group("Pclass")
class_table.barh('Pclass','count')

d. Sort the data by age and show the youngest 5 passengers.

In [24]:
youngest_first=titanic_table.sort('Age')
youngest_first.show(5)

e. Now sort by age from oldest to youngest and show the oldest 5 passengers.

In [25]:
eldest_first=titanic_table.sort('Age',descending=True)
eldest_first.show(5)

Eliminate these “nan” values and try again.

In [26]:
eldest_first_nan=eldest_first.where('Age',are.above(0))
eldest_first_nan.show(5)

f. Find the survival rate for passengers of the Titanic, broken down by passenger
class. (HINT: select the columns you care about and then apply the group
method, summarizing with the mean.)

In [27]:
survival_table=titanic_table.select('Survived','Pclass')
survival_table1=survival_table.group('Pclass',sum)
survival_table1

In [28]:
survival_array=survival_table1.column('Survived sum')/(136+87+119)
first=survival_array.item(0)
second=survival_array.item(1)
third=survival_array.item(2)
survival_rate=Table().with_columns("PClass",make_array("1","2","3"),"survived",make_array(first,second,third))
survival_rate

g. Now that you have some familiarity with the dataset, create two of your own
questions and answer them.

In [20]:
#average age of passengers
age_array=titanic_table.select('Age')
age_array1=age_array.where('Age',are.above(0))